{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Qwen2VLForConditionalGeneration",
    "parent_library": "src.vlm_backbone.qwen2_vl.modeling_qwen2_vl"
  },
  "base_model_name_or_path": "Qwen/Qwen2-VL-2B-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj",
    "o_proj",
    "out_proj",
    "qkv_proj",
    "gate_up_proj",
    "down_proj",
    "k_proj"
  ],
  "task_type": null,
  "use_dora": true,
  "use_rslora": false
}